import React, { Component } from 'react';
import dayDefinition from '../assets/day-definition.gif';
import gradeDefinition from '../assets/grade-definition.gif';
import roomFeatureDefinition from '../assets/room-feature-definition.gif';
import roomDefinition from '../assets/room-definition.gif';
import subjectDefinition from '../assets/subject-definition.gif';
import changePlace from '../assets/change-place.gif';
import clash from '../assets/clash.gif';
import parallel from '../assets/parallel.gif';
import removeLesson from '../assets/remove-lesson.gif';
import resetAllTables from '../assets/reset-all-tables.gif';
import resetTable from '../assets/reset-table.gif';
import saveChanges from '../assets/save-changes.gif';
import selectClass from '../assets/select-class.gif';
import selectLesson from '../assets/select-lesson.gif';
import selectRoom from '../assets/select-room.gif';
import specificRoom from '../assets/specific-room.gif';
import split from '../assets/split.gif';
import dragLesson from '../assets/drag-lesson.gif';
import details from '../assets/details.gif';
import exception from '../assets/exception.gif';
import grouping from '../assets/grouping.gif';
import lessonSplit from '../assets/lesson-split.gif';
import teacherDefinition from '../assets/teacher-definition.gif';
import update from '../assets/update.gif';

class Guide extends Component {
    render() {
        return (
            <div style={{ textAlign: 'right' }}>
                <h3 className="mt-2">ברוכים הבאים למערכת בניית מערכת שעות</h3>
                <h4>במהלך המדריך הבא נסביר מה השלבים הנכונים לבניית מערכת השעות תוך כדי הצגת דוגמאות להבנה טובה יותר.</h4>
                <p>
                    תהליך בניית מערכת השעות מורכב משני חלקים עיקריים – חלק ראשון הוא הגדרת נתוני בית הספר (חדרי לימוד, מקצועות, מורים וכדומה) והחלק השני הוא
                    בניית מערכת השעות הבית ספרית על סמך הנתונים שהוגדרו.
                </p>
                <p className="font-weight-bold">
                    ולכן לפני שנבצע את החלק של בניית מערכת השעות נצטרך קודם להגדיר את כל נתוני בית הספר בצורה ובסדר הנכונים ולאחר שנגדיר את כל נתוני בית הספר
                    נתחיל עם חלק הבנייה של מערכת השעות.
                </p>
                <h4>חלק ראשון – הגדרת נתוני בית הספר:</h4>
                <p>
                    בחלק זה נגדיר את כל נתוני בית הספר, הנתונים שנצטרך להגדיר הם: הגדרת שלד מערכת השעות הכללית של בית הספר, הגדרת כל השכבות והכיתות בבית הספר,
                    הגדרת כל חדרי הלימוד הקיימים בבית הספר, הגדרת כל המקצועות הנלמדים בבית הספר, הגדרת כל המורים המלמדים בבית הספר ולבסוף הגדרת שיעורים שנרצה
                    לשבץ במערכת השעות.
                </p>
                <p>
                    הערה חשובה לפני שמתחילים, סדר השלבים המתואר בחלק זה הינם הצורה הנכונה להגדיר את נתוני המערכת (ישנם נתונים שיש להגדיר רק על סמך נתונים
                    שהוגדרו כבר) ולכן מומלץ להגדיר את הנותנים בסדר השלבים המתואר.
                </p>
                <h5>שלבי הגדרת נתוני בית הספר בסדר ובצורה הנכונים:</h5>
                <ul></ul>
                <ul>
                    <li>
                        נלחץ על לשונית "הגדרת נתונים ושיעורים".
                        <br />
                        <p>
                            כעת יפתח לנו סרגל כלים משני שמציג את כל הנתונים שניתן להגדיר (שלד המערכת, שכבות וכיתות, חדרי לימוד, מקצועות מורים והגדרת שיעורים).
                        </p>
                    </li>
                    <h6>שלב ראשון – הגדרת שלד המערכת:</h6>
                    <li>
                        נלחץ על לשונית "שלד המערכת"
                        <br />
                        <p>במסך זה נצטרך להגדיר את שלד מערכת השעות של בית הספר באופן כללי. נבחר יום בשבוע ונגדיר לו שעת התחלה ושעת סיום.</p>
                        <p>בכל שלב במהלך הגדרת שלד המערכת ניתן לערוך או למחוק יום שהוגדר.</p>
                        <ul>
                            הערות לשלב זה:
                            <li>
                                אם כבר בנינו והגדרנו מערכת שעות (אפילו רק לכיתה אחת), שינויים בשלד המערכת לא ישפיעו על המערכת שהגדרנו, לכן חשוב להגדיר את שלד
                                המערכת בתור התחלה בצורה המדויקת ביותר.
                            </li>
                            <li>
                                אם כן נצטרך לבצע שינוי בשלד המערכת לאחר שכבר התחלנו לבנות את מערכת השעות, נצטרך תחילה למחוק את מערכת השעות שבנינו ואז השינויים
                                שנבצע על שלד המערכת ישפיעו על תצוגת מערכת השעות.
                            </li>
                        </ul>
                    </li>
                    <br />
                    דוגמא להגדרת יום:
                    <div className="w-100 text-center">
                        <img src={dayDefinition} className="border" alt="gif" width="75%"></img>
                    </div>
                    <br />
                    <h6>שלב שני – הגדרת שכבות וכיתות:</h6>
                    <li>
                        נלחץ על לשונית "שכבות וכיתות"
                        <br />
                        <p>במסך זה נצטרך להגדיר את שכבות וכיתות בית הספר. נבחר שכבה ונגדיר את מספר הכיתות הלומדות בה.</p>
                        <p>בכל שלב במהלך הגדרת שכבות וכיתות ניתן לערוך או למחוק שכבה שהגדרנו.</p>
                        <ul>
                            הערות לשלב זה:
                            <li>
                                אם כבר בנינו והגדרנו מערכת שעות (אפילו רק לכיתה אחת), שינויים בשכבות וכיתות לא ישפיעו על המערכת שהגדרנו, לכן חשוב להגדיר את
                                שכבות וכיתות בית הספר בתור התחלה בצורה המדויקת ביותר.
                            </li>
                            <li>
                                אם כן נצטרך לבצע שינוי בשכבות הכיתה לאחר שכבר התחלנו להגדיר את מערכת השעות, נצטרך תחילה למחוק את מערכת השעות שהגדרנו ואז שינויים
                                של שכבות וכיתות בית הספר ישפיעו על תצוגת מערכת השעות.
                            </li>
                        </ul>
                    </li>
                    <br />
                    דוגמא להגדרת שכבה:
                    <div className="w-100 text-center">
                        <img src={gradeDefinition} className="border" alt="gif" width="75%"></img>
                    </div>
                    <br />
                    <h6>שלב שלישי – הגדרת חדרי לימוד:</h6>
                    <li>
                        נלחץ על לשונית " חדרי לימוד"
                        <br />
                        <p>במסך זה נצטרך להגדיר את כל חדרי הלימוד בבית הספר.</p>
                        <p>בכל שלב במהלך הגדרת חדרי הלימוד ניתן לערוך או למחוק חדר לימוד שהגדרנו.</p>
                        <ul>
                            הערות לשלב זה:
                            <li>
                                אם כבר בנינו והגדרנו מערכת שעות (אפילו רק לכיתה אחת), שינויים בחדרי הלימוד לא ישפיעו על המערכת שהגדרנו, לכן חשוב להגדיר את חדרי
                                הלימוד בבית הספר בתור התחלה בצורה המדויקת ביותר.
                            </li>
                            <li>
                                אם כן נצטרך לבצע שינוי בחדרי הלימוד לאחר שכבר התחלנו להגדיר את מערכת השעות, נצטרך תחילה למחוק את השיעורים שמשויכים לחדרי הלימוד
                                שנרצה למחוק או לערוך (בדף הגדרת השיעורים) ולאחר מכן נוכל להמשיך לבנות את מערכת השעות עם חדרי הלימוד החדשים.
                            </li>
                            <li>ניתן למיין את טבלת חדרי הלימוד שהוגדרו בסדר אלפא בתי עולה או יורד לפי שם חדר הלימוד.</li>
                        </ul>
                        <br />
                        <p>
                            בנוסף, במסך זה ישנה אפשרות להגדיר מאפייני חדר שאותם ניתן לשייך לחדרי לימוד מסוימים (אפשרות זהו נועדה רק להקל על בניית המערכת בהמשך
                            אך אינה חלק הכרחי מהגדרת נותני בית הספר, כמו כן אין צורך להגדיר לכל חדר לימוד מאפיין, חלק זה נועד עבור חדרי לימוד שייעודים עבור
                            מקצועות מסוימים).
                        </p>
                        <p>דוגמא להגדרת מאפיין, חדר לימוד שאנו יודעים מראש שצריך שיהיו בו מחשבים:</p>
                        <ul>
                            <li>
                                נגדיר מאפיין שנקרא "מחשבים".
                                {/* <p>**תמונה של הגדרת מאפיין מחשבים**</p> */}
                                <div className="w-100 text-center">
                                    <img src={roomFeatureDefinition} className="border" alt="gif" width="75%"></img>
                                </div>
                            </li>
                            <br />
                            <li>
                                נגדיר כעת את חדר הלימוד "חדר מחשבים" ונשייך לו את המאפיין "מחשבים".
                                {/* <p>**תמונה של שלב זה**</p> */}
                                <div className="w-100 text-center">
                                    <img src={roomDefinition} className="border" alt="gif" width="75%"></img>
                                </div>
                            </li>
                        </ul>
                        <br />
                        <p>בכל שלב ניתן למחוק מאפיינים שהגדרנו.</p>
                        <ul>
                            הערות לשלב הגדרת מאפייני חדר:
                            <li>
                                לאחר הגדרת מאפייני חדר, נוכל לראות במסך הבא של הגדרת מקצועות שיש אופציה לשייך למקצוע את המאפיינים שהגדרנו, ובשלב בניית מערכת
                                השעות ברגע שנצטרך להתאים לשיעור מסוים חדר לימוד המערכת תדע להציג לנו את חדרי הלימוד המתאימים בלבד למקצוע מסוים.
                            </li>
                            <li>
                                אם כבר הגדרנו מקצועות או חדרי לימוד עם מאפיינים, מחיקת מאפיינים לא תשפיע על חדרי הלימוד או המקצועות שכבר הוגדרו לאותם מאפיינים.
                            </li>
                            <li>
                                אם כן נרצה למחוק מאפיינים מסוימים שכבר משויכים לחדרי לימוד או מקצועות, נצטרך תחילה למחוק את אותם חדרי לימוד ומקצועות ולאחר מכן
                                נוכל למחוק את המאפיינים שרצינו.
                            </li>
                        </ul>
                    </li>
                    <br />
                    <h6>שלב רביעי – הגדרת מקצועות:</h6>
                    <li>
                        נלחץ על לשונית "מקצועות"
                        <br />
                        <p>במסך זה נצטרך להגדיר את כל המקצועות הנלמדים בבית הספר.</p>
                        <ul>
                            <li>
                                <p>נזין את שם המקצוע.</p>
                            </li>
                            <li>
                                <p>נבחר באיזה כיתות הוא נלמד.</p>
                            </li>
                            <li>
                                <p>נסמן אם המקצוע נלמד לבגרות, אם כן נצטרך להגדיר את הגמול עבור המקצוע.</p>
                            </li>
                            <li>
                                <p>
                                    נצטרך לבחור האם המקצוע מערבב שכבה (דוגמא למקצוע מערבב שכבה היא למשל מקצוע שמחולק להקבצות או נלמד כמגמה). אם נבחר שכן מערבב
                                    שכבה נשאל האם הוא נלמד בהקבצות, אם נבחר שכן נצטרך לבחור לכמה הקבצות הוא מחולק.
                                </p>
                            </li>
                            <li>
                                <p>נבחר מה המקצוע דורש (מאפיינים שהגדרנו בשלב הגדרת חדרי לימוד).</p>
                            </li>
                        </ul>
                        <p>בכל שלב במהלך הגדרת שכבות וכיתות ניתן לערוך או למחוק שכבה שהגדרנו.</p>
                        <ul>
                            הערות לשלב זה:
                            <li>
                                אם כבר הגדרנו שיעורים שמשויכים למקצועות שנרצה למחוק או לערוך, מחיקת או עריכת מקצועות אלו במסך הגדרת מקצועות לא ישפיעו על שיעורים
                                אלו. לכן חשוב להגדיר את מקצועות בית הספר בתור התחלה בצורה המדויקת ביותר כדי להימנע מכמה שפחות שינויים בשלבים מתקדמים בניית
                                המערכת.
                            </li>
                            <li>
                                אם כן נצטרך לבצע שינוי במקצועות בית הספר לאחר שכבר שייכנו אותם לשיעורים מסוימים, נצטרך תחילה למחוק את השיעורים שמשויכים לאותם
                                מקצועות ולאחר מכן נסיר או נערוך מקצועות אלו ללא דאגה.
                            </li>
                            <li>ניתן למיין את טבלת המקצועות שהוגדרו בסדר אלפא בתי עולה או יורד לפי שם המקצוע או לפי שכבות בית הספר.</li>
                        </ul>
                    </li>
                    <br />
                    דוגמא להגדרת מקצוע:
                    <div className="w-100 text-center">
                        <img src={subjectDefinition} className="border" alt="gif" width="75%"></img>
                    </div>
                    <br />
                    <h6>שלב חמישי – הגדרת מורים:</h6>
                    <li>
                        נלחץ על לשונית "מורים"
                        <br />
                        <p>במסך זה נצטרך להגדיר את כל המורים המלמדים בבית הספר.</p>
                        <ul>
                            <li>
                                <p>נזין את שם המורה.</p>
                            </li>
                            <li>
                                <p>נזין את מספר שעות ההוראה השבועיות המקסימליות של המורה.</p>
                            </li>
                            <li>
                                <p>נבחר יום חופש רצוי במהלך השבוע של המורה.</p>
                            </li>
                            <li>
                                <p>נסמן באיזה שכבות המורה מלמד.</p>
                            </li>
                            <li>
                                <p>
                                    נסמן מקצועות שהמורה מלמד בטבלת המקצועות (המקצועות שיופיעו בטבלת המקצועות יהיו מקצועות שרק הכיתות שסימנו שהמורה מלמד לומדות).
                                </p>
                            </li>
                        </ul>
                        <p>בכל שלב במהלך הגדרת המורים ניתן לערוך או למחוק מורה שהגדרנו.</p>
                        <ul>
                            הערות לשלב זה:
                            <li>
                                אם כבר הגדרנו שיעורים שמשויכים למורים שנרצה למחוק או לערוך, מחיקת או עריכת מורים אלו במסך הגדרת המורים לא ישפיעו על שיעורים אלו.
                                לכן חשוב להגדיר את המורים בבית הספר בתור התחלה בצורה המדויקת ביותר כדי להימנע מכמה שפחות שינויים בשלבים מתקדמים בניית המערכת.
                            </li>
                            <li>
                                אם כן נצטרך לבצע שינוים במורי בית הספר לאחר שכבר שייכנו אותם לשיעורים מסוימים, נצטרך תחילה למחוק את השיעורים שמשויכים לאותם
                                מורים ולאחר מכן נסיר או נערוך מורים אלו ללא דאגה.
                            </li>
                            <li>ניתן למיין את טבלת המורים שהוגדרו בסדר אלפא בתי עולה או יורד לפי שם המורה או לפי שכבות בית הספר.</li>
                        </ul>
                    </li>
                    <br />
                    דוגמא להגדרת מורה:
                    <div className="w-100 text-center">
                        <img src={teacherDefinition} className="border" alt="gif" width="75%"></img>
                    </div>
                    <br />
                    <h6>שלב שישי – הגדרת שיעורים:</h6>
                    <li>
                        נלחץ על לשונית "הגדרת שיעורים"
                        <br />
                        <p>
                            במסך זה נצטרך להגדיר את כל השיעורים שנרצה לשבץ במערכת השעות הבית ספרית.
                            <br />
                            בחלקו העליון של הדף נראה טבלה חד מימדית עם שדות שיש למלא (שעות לימוד, מורה, מקצוע, שכבה וכיתה). טבלה זו תייצג עברונו שיעור שנרצה
                            להגדיר ולשבץ במערכת השעות.
                            <br />
                            כל עמודה בטבלה מייצגת פרמטר אחר בהרכבת שיעור, כאשר בחירת הפרמטר ניתנת מרשימת נתונים שהגדרנו בשלבים הקדומים.
                        </p>
                        <ul>
                            <li>
                                <p>נבחר את מספר שעות לימוד השיעור (ניתן לבחור בין שעה עד עשר שעות לימוד).</p>
                            </li>
                            <li>
                                <p>נבחר את המורה המלמד את השיעור (לחיצה על עמודה זו תציג לנו את כל המורים שהוגדרו בדף הגדרת המורים).</p>
                            </li>
                            <li>
                                <p>נבחר את המקצוע השיעור (לחיצה על עמודה זו תציג את כל השיעורים שהוגדרו עבור המורה שבחרנו).</p>
                            </li>
                            <li>
                                <p>נבחר את השכבה הלומדת את השיעור (לחיצה על עמודה זו תציג את השכבות שלומדות את המקצוע שנבחרנו שנלמדות ע"י המורה שנבחרנו).</p>
                            </li>
                            <li>
                                <p>
                                    נבחר את הכיתה מתוך השכבה הלומדת את השיעור (במקרה שנבחר מקצוע שמערבב שכבה עבור המקצוע והמורה שנבחרו, משבצת זו תציג אוטומטית
                                    את כל כיתות השכבה).
                                </p>
                            </li>
                        </ul>
                        <p>בכל שלב במהלך הגדרת שכבות וכיתות ניתן לערוך או למחוק שיעור שהגדרנו.</p>
                        <p>פיצ'רים נוספים עבור דף זה:</p>
                        <ul>
                            <li>
                                פיצול שעות שיעור -
                                <p>
                                    ישנה אפשרות לפצל שיעור שנלמד יותר משעה אחת למספר שיעורים שאותם נרצה לשבץ בנפרד במערכת השעות.
                                    <br />
                                    ברגע שנבחר בעמודת שעות הלימוד יותר משעת לימוד אחת יופיע מלבן מתחת לטבלת הגדרת השיעור אשר שואל אותנו "האם השיעור מפוצל למספר
                                    שיעורים במהלך השבוע?", במקרה שנבחר כן נצטרך לבחור את מספר הפיצולים (ניתן לפצל שיעור לעד שלושה שיעורים נפרדים). לאחר שבחרנו
                                    את מספר הפיצולים נצטרך להגדיר את מספר שעות הלימוד של כל שיעור בנפרד.
                                </p>
                                <p>
                                    דוגמא לפיצול שיעור – שיעור חינוך הנלמד ע"י יאיר פרבי בכיתה ז1 נלמד לאורך שלוש שעות שבועיות, כאשר הוא מפוצל לשני שיעורים,
                                    שיעור אחד לשעה ושיעור שני לשעתיים.
                                    <div className="w-100 text-center">
                                        <img src={lessonSplit} className="border" alt="gif" width="75%"></img>
                                    </div>
                                </p>
                            </li>
                            <br />
                            <li>
                                הגדרת שיעור למקצוע שהוגדר כמחולק להקבצות -
                                <p>
                                    אם במהלך הגדרת שיעור נבחר מקצוע שהוגדר כנלמד בהקבצות בדף הגדרת המקצועות, יופיעו על המסך טבלאות חד מימדיות נוספות (כמספר
                                    ההקבצות שהוגדרו לאותו מקצוע) להגדרת שיעור שאותם יש למלא גם.
                                    <br />
                                    המערכת יוצאת מנקודת הנחה שברגע שמקצוע הוגדר כנלמד בהקבצות, המקצוע ילמד באותן שעות ובאותו יום במערכת השעות.
                                </p>
                                <p>
                                    דוגמא להגדרת שיעור שמחלוק להקבצות – המקצוע אנגלית בשכבה ז' נלמד בשלוש הקבצות.
                                    <div className="w-100 text-center">
                                        <img src={grouping} className="border" alt="gif" width="75%"></img>
                                    </div>
                                </p>
                            </li>
                            <br />
                            <li>
                                עדכון שעות מורה שבועיות -
                                <p>
                                    ברגע שהוגדר שיעור, מספר השעות שהוא נלמד מתווספות למכסת שעות ההוראה השבועיות של המורה המלמד אותו.
                                    <br />
                                    את כמות שעות ההוראה הנוכחיות שהוגדרו כבר למורה מסוים תמיד ניתן לראות בטבלת המורים שהוגדרו בדף הגדרת המורים.
                                    <br />
                                    ברגע שננסה להגדיר שיעור שיחרוג מכמות שעות ההוראה השבועיות המקסימליות של המורה שהוגדר עבור שיעור זה, המערכת תתריע על כך ולא
                                    תינתן האפשרות להגדיר שיעור זה (את שעות ההוראה המקסימליות ניתן לעדכן בכל רגע בדף הגדרת המורים והמערכת תדע להתייחס אליהן
                                    בהתאם).
                                </p>
                                <p>
                                    דוגמא לעדכון שעות מורה שבועיות – למורה יאיר פרבי הוגדרו 3 שעות הוראה שבועיות מקסימליות. תחילה נגדיר את שיעור הבעה הנלמד ע"י
                                    יאיר בכיתה ז2 למשך שעתיים.
                                    <div className="w-100 text-center">
                                        <img src={update} className="border" alt="gif" width="75%"></img>
                                    </div>
                                </p>
                                <br />
                                <p>
                                    לאחר מכן נרצה להגדיר את שיעור חינוך הנלמד ע"י יאיר בכיתה ז2 למשך שעתיים ונראה שלא יהיה ניתן להגדירו כי שיעור זה יגרום לחריגה
                                    מכמות שעות ההוראה השבועיות המקסימליות של יאיר.
                                    <div className="w-100 text-center">
                                        <img src={exception} className="border" alt="gif" width="75%"></img>
                                    </div>
                                </p>
                            </li>
                            <li>
                                הצגת פרטי מורה ופרטי מקצוע -
                                <p>
                                    מתחת לטבלה החד מימדית להגדרת שיעור ישנם שני כפתורים, "הצגת פרטי מורה" ו-"הצגת פרטי מקצוע", בכל שלב של הגדרת שיעור ניתן לקבל
                                    מידע עזר נוסף עבור המורה והמקצוע שנבחרו.
                                </p>
                                <p>
                                    ברגע שנבחר מורה בתהליך הגדרת שיעור ונחלץ על כפתור "הצגת פרטי מורה" יופיע חלון מתחת לטבלת הגדרת השיעור עם מידע על המורה
                                    שנבחר, המידע המופיע בחלון מציג לנו את מצב שעות ההוראה השבועיות של המורה שנבחר.
                                </p>
                                <p>
                                    ברגע שנבחר מקצוע בתהליך הגדרת שיעור ונחלץ על כפתור "הצגת פרטי מקצוע" יופיע חלון מתחת לטבלת הגדרת השיעור עם מידע על המקצוע
                                    שנבחר, המידע המופיע בחלון מציג לנו את פרטי המקצוע ומה הקשר בין המקצוע למורה שנבחר.
                                </p>
                                דוגמא להצגת פרטי מורה ופרטי מקצוע - נבדוק את פרטי המורה יאיר פרבי ואת פרטי המקצוע הבעה שהוא מלמד
                                <div className="w-100 text-center">
                                    <img src={details} className="border" alt="gif" width="75%"></img>
                                </div>
                            </li>
                        </ul>
                    </li>
                </ul>
                <br />
                <h4>חלק שני – בניית מערכת השעות:</h4>
                <p>לאחר שהגדרנו את כל השיעורים שנרצה לשבץ במערכת השעות נתחיל את תהליך הבנייה של המערכת.</p>
                <p>
                    <li>בסרגל הכלים הראשי של האפליקציה נלחץ על לשונית "בניית מערכת השעות".</li>
                </p>
                <p>לאחר טעינת הדף נראה יצגו לנו הדברים הבאים: </p>
                <ul>
                    <li>
                        <p>מתחת לסרגל הכלים הראשי נראה סרגל כלים משני עם כל כיתות בית הספר.</p>
                    </li>
                    <li>
                        <p>במרכז הדף נראה טבלה שמייצגת את שלד מערכת השעות הבית ספרית כפי שהגדרנו.</p>
                    </li>
                    <li>
                        <p>
                            בתחתית הדף נראה שלושה מלבנים בשורה אחת – המלבן הימני ביותר מראה לנו את השיעורים שיש לשבץ, המלבן השמאלי ביותר מראה לנו את כל חדרי
                            הלימוד בבית הספר והמלבן האמצעי מייצג לנו שיעור בודד שנרצה לשבץ במערכת השעות.
                        </p>
                    </li>
                </ul>
                <h5>תהליך שיבוץ שיעור בטבלה:</h5>
                <ul>
                    <h6>שלב ראשון – בחירת כיתה.</h6>
                    <li>בסרגל הכלים המשני נבחר כיתה שנרצה לבנות עבורה מערכת שעות.</li>
                    <br />
                    <p>
                        לאחר לחיצה על כיתה מסוימת נוכל לראות שטבלת מערכת השעות מתעדכנת לפי השיעורים שכבר שובצו עבור כיתה זו ושתוכנו של המלבן שמייצג את השיעורים
                        שיש לשבץ עבור הכיתה התמלא במספר מלבנים קטנים ולחצים כאשר כל מלבן קטן שכזה מייצג שיעור שיש לשבץ במערכת עבור כיתה זו.
                    </p>
                    <br />
                    דוגמא - נבחר את כיתה ז2 ונגלול לתחתית הדף ונראה את כל השיעורים שיש לשבץ שהוגדרו לכיתה
                    <div className="w-100 text-center">
                        <img src={selectClass} className="border" alt="gif" width="75%"></img>
                    </div>
                </ul>
                <br />
                <ul>
                    <h6>שלב שני - הרכבת שיעור פוטנציאלי לשיבוץ.</h6>
                    <p>על מנת לשבץ שיעור במערכת השעות יש צורך לשייך שיעור לחדר לימוד ולאחר מכן יהיה ניתן לשבצו במערכת השעות.</p>
                    <li>
                        נלחץ על שיעור שנרצה לשבץ מתוך אחד השיעורים שנמצאים במלבן "שיעורים עבור כיתה זו" – ברגע שנלחץ על שיעור נוכל לראות מספר דברים:
                        <ul>
                            <li>השיעור מוצג במלבן האמצעי שמייצג שיעור פוטנציאלי לשיבוץ.</li>
                            <li>צבען של משבצות הטבלה השתנו.</li>
                        </ul>
                    </li>
                    <br />
                    דוגמא - נבחר את השיעור חינוך שנלמד ע"י יאיר פרבי בכיתה ז2
                    <div className="w-100 text-center">
                        <img src={selectLesson} className="border" alt="gif" width="75%"></img>
                    </div>
                    <br />
                    <li>
                        נלחץ על חדר לימוד שנרצה לשייך לשיעור שבחרנו מתוך אחד מחדרי הלימוד שנמצאים במלבן " חדרי לימוד" – ברגע שנלחץ על חדר לימוד נוכל לראות מספר
                        דברים:
                        <ul>
                            <li>השיעור התווסף לשיעור שנמצא במלבן האמצעי שמייצג שיעור פוטנציאלי לשיבוץ.</li>
                            <li>צבען של משבצות הטבלה השתנו.</li>
                        </ul>
                    </li>
                    <br />
                    דוגמא - נבחר את חדר הלימוד "חדר ז1"
                    <div className="w-100 text-center">
                        <img src={selectRoom} className="border" alt="gif" width="75%"></img>
                    </div>
                    <br />
                    <p>לאחר ששייכנו חדר לימוד לשיעור נראה הודעה במלבן האמצעי שיש כעת אפשרות לגרור את השיעור למערכת השעות.</p>
                </ul>
                <br />
                <ul>
                    <h6>שלב שלישי - הבנה של היכן ניתן לשבץ את השיעור שהרכבנו.</h6>
                    <p>שמנו לב שברגע שבחרנו שיעור ו/או חדר לימוד צבעי המשבצות בטבלה ישתנו.</p>
                    <p>
                        צבעי משבצות אלו נותנים לנו אינדיקציה לגבי היכן ניתן לשבץ את השיעור שבחרנו במערכת השעות בלי ליצור התנגשויות עם שיעורים אחרים שכבר קיימים
                        במערכת השעות הכלל בית ספרית.
                    </p>
                    <p>הסבר על צבען המשנה של המשבצות:</p>
                    <p>ברגע שלנחץ על שיעור מרשימת השיעורים שיש לשבץ ו/או על חדר לימוד מרשימת חדרי הלימוד בבית הספר נראה שמשבצות טבלת מערכת השעות משתנים.</p>
                    <ul>
                        <li>
                            <p>
                                <span
                                    style={{
                                        backgroundColor: 'rgb(212, 237, 218)'
                                    }}
                                >
                                    צבע ירוק בהיר
                                </span>
                                – המורה שמלמד את השיעור שבחרנו פנוי במשבצת זו ו/או חדר הלימוד שבחרנו פנוי במשבצת זו וניתן לשבץ במשבצת.
                            </p>
                        </li>
                        <li>
                            <div>
                                <span
                                    style={{
                                        backgroundColor: 'rgb(248, 215, 218)'
                                    }}
                                >
                                    צבע אדום
                                </span>
                                – לא ניתן לשבץ שיעור במשבצת זו מאחת מהסיביות הבאות:
                                <ul>
                                    <li>המורה שמלמד את השיעור שבחרנו לא פנוי במשבצת זו ו/או חדר הלימוד שבחרנו לא פנוי במשבצת זו.</li>
                                    <li>לא ניתן לשבץ במשבצת זו בגלל אורך השיעור שבחרנו.</li>
                                    <li>במקרה שבחרנו שיעור שמערבב שכבה, משבצות בהן אחת מכיתות השכבה הלומדת בשיעור שבחרנו כבר לומדת לא יהיה ניתן לשבץ.</li>
                                </ul>
                            </div>
                        </li>
                        <li>
                            <p>
                                <span style={{ backgroundColor: '#fff3cd' }}>צבע צהוב</span>– נשים לב שברגע שבחרנו שיעור מסוים אחת או יותר מהמשבצות של ימות
                                השבוע נצבעו בצבע צהוב. משבצת של יום שנצבעת בצהוב מייצגת את יום חופש הרצוי של המורה שמלמד את השיעור שבחרנו. אין הגבלה לשבץ שיעור
                                ביום חופש של המורה שמלמד את השיעור שנבחר, הצבע הצהוב רק מזכיר לנו שביום זה המורה רצה יום חופש.
                            </p>
                        </li>
                    </ul>
                    <p>הערה לגבי שלב זה:</p>
                    <p>
                        ברגע שבחרנו שיעור וכתוצאה מכך משבצות מסוימות נצבעות באדום עקב התנגשות מסוימת שנוצרת עבור שיעור זה, מתחת לשיעור הפוטנציאלי לשיבוץ יופיעו
                        כפתורים שבעת לחיצה עליהם יוצגו לנו הנתונים עבור ההתנגשויות שנצרו.
                    </p>
                    <br />
                    דוגמא להצגת התנגשויות:
                    <div className="w-100 text-center">
                        <img src={clash} className="border" alt="gif" width="75%"></img>
                    </div>
                </ul>
                <br />
                <ul>
                    <h6>שלב רביעי – שיבוץ השיעור במערכת השעות.</h6>
                    <p>
                        ברגע שהבנו היכן ניתן לשבץ את השיעור שבחרנו ונרצה לשבץ אותו במערכת השעות נוכל פשוט לגרור את השיעור (את השיעור ניתן לגרור רק מהלבן האמצעי
                        של "נתונים על שיעור פוטנציאלי לשיבוץ" ברגע שיופיע המשפט "יש כעת אפשרות לגרור את השיעור לטובת שיבוץ בטבלה" מעל מלבן השיעור).
                    </p>
                    <p>
                        ברגע שנגרור את השיעור ונעבור על הטבלה נראה ברגע שנגרור את השיעור מעל משבצת בצבע{' '}
                        <span style={{ backgroundColor: 'rgb(212, 237, 218)' }}>ירוק בהיר</span>, צבעה של המשבצת יהפוך לצבע{' '}
                        <span style={{ backgroundColor: 'rgb(171, 218, 182)' }}>ירוק כהה</span>. צבע זה מראה לנו שאם נשחרר את לחצן העכבר השיעור ישתבץ החל ממשבצת
                        זו.
                    </p>
                    <br />
                    דוגמא לשיבוץ שיעור במערכת השעות:
                    <div className="w-100 text-center">
                        <img src={dragLesson} className="border" alt="gif" width="75%"></img>
                    </div>
                </ul>
                <br />
                <ul>
                    <h6>שלב חמישי – שמירת שינויים.</h6>
                    <p>
                        חשוב מאוד! ברגע שסיימנו לשבץ או שאנחנו רוצים לעבור לדף אחר באפליקציה, על מנת שכל השיבוציים והשינויים שביצענו במערכת השעות ישמרו יש ללחוץ
                        על כפתור “שמור שיניים”.
                    </p>
                    <p>
                        ברגע שנחלץ על הכפתור נתבקש להמתין וברגע שכל השינויים ישמרו תופיעה ההודעה "השינויים נשמרו בהצלחה", כעת ניתן לעבור לכל דף אחר באפליקציה או
                        לצאת מהאפליקציה מבלי לדאוג שכל השינויים שביצענו לא ישמרו.
                    </p>
                    <br />
                    דוגמא לשמירת שינויים:{' '}
                    <div className="w-100 text-center">
                        <img src={saveChanges} className="border" alt="gif" width="75%"></img>
                    </div>
                </ul>
                <br />
                <p className="font-weight-bold">
                    לאחר שהבנו כיצד לשבץ שיעורים במערכת השעות, יש מספר פיצ'רים נוספים העוזרים לנו בתהליך בניית מערכת השעות שחשוב להכיר עבור דף זה:
                </p>
                <ul>
                    <h5>הסרת שיעור ממערכת השעות.</h5>
                    <p>בכל שלב במהלך בניית מערכת השעות ניתן להסיר שיעור שכבר שובץ במערכת.</p>
                    <p>
                        אם נרצה להסיר שיעור ממערכת השעות נצטרך ללחוץ על השיעור שנרצה להסיר (מסגרתו תהפוך לכחולה בשביל שנבין שעל שיעור זה לחצנו) ונשים לב שהכפתור
                        של "הסרת שיעור" שנמצא בתחתית הטבלה יהפוך מלא פעיל לפעיל. כעת כל מה שנשאר לנו לעשות זה ללחוץ על כפתור "הסרת שיעור" והשיעור ימחק ממערכת
                        השעות ויופיעו שוב במלבן הימיני שבתחתית הדף, מלבן ה"שיעורים הנלמדים בכיתה זו".
                    </p>
                    <br />
                    דוגמא להסרת שיעור:
                    <div className="w-100 text-center">
                        <img src={removeLesson} className="border" alt="gif" width="75%"></img>
                    </div>
                </ul>
                <br />
                <ul>
                    <h5>שינוי מיקום של שיעור שכבר משובץ במערכת השעות.</h5>
                    <p>בכל שלב במהלך בניית מערכת השעות ניתן להזיז שיעור שכבר שובץ במערכת למשבצת אחרת במערכת השעות.</p>
                    <p>אם נרצה לשנות מיקום של שיעור שכבר שובץ במערכת השעות למשבצת של שעות אחרות או יום אחר נוכל לבצע זאת פשוט ע"י גרירת השיעור למקום שנרצה.</p>
                    <p>
                        ברגע שנלחץ על או שנגרור את השיעור שנרצה לשנות את מיקמו צבעי משבצות הטבלה ישתנו בדיוק לפי החוקיות שהוסברה לנו בתהליך שיבוץ שיעור בטבלה על
                        מנת שנבין היכן ניתן לשבץ את השיעור שנרצה להזיז.
                    </p>
                    <br />
                    דוגמא לשינוי מקום של שיעור:
                    <div className="w-100 text-center">
                        <img src={changePlace} className="border" alt="gif" width="75%"></img>
                    </div>
                </ul>
                <br />
                <ul>
                    <h5>שיבוץ שיעור מקבילי בכל כיתות השכבה במקרה של שיבוץ שיעור מערבב שכבה.</h5>
                    <p>ברגע שנשבץ שיעור שמערבב שכבה במערכת השעות, שיעור זה ישובץ בכל כיתות השכבה למרות שמבחינת תצוגה אנחנו רק רואים מערכת שעות של כיתה אחת.</p>
                    <br />
                    <p>דוגמא:</p>
                    נשבץ את שיעור מתמטיקה בכיתה ז1 (שיעור מתמטיקה מוגדר כנלמד כמערבב שכבה) ולאחר מכן נראה שגם בטבלאות של מערכי השעות של כיתות ז2 ו-ז3 שיעור
                    מתמטיקה שובץ באותו יום ובאותה שעה.
                    <div className="w-100 text-center">
                        <img src={parallel} className="border" alt="gif" width="75%"></img>
                    </div>
                </ul>
                <br />
                <ul>
                    <h5>פיצול משבצת/משבצות לשני שיעורים שמערבבים שכבה.</h5>
                    <p>ישנה אפשרות לפצל משבצות שיכילו שני שיעורים שונים בתנאים מסוימים.</p>
                    <p>
                        המערכת מאפשרת לשיעורים שהוגדרו כנלמדים כמערבבים שכבה אך אינם נלמדים בהקבצות להילמד במקביל לשיעורים עם אותן הגדרות ואותן מספר שעות לימוד.
                    </p>
                    <p>
                        ברגע ששיעור שהוגדר כנלמד כמערבב שכבה אך לא בהקבצה משובץ כבר במערכת השעות ונרצה לשבץ שיעור נוסף במערכת עם אותן הגדרות ואותן מספר שעות
                        לימוד, נשים לב שברגע שנרצה לראות היכן ניתן לשבץ את השיעור החדש המשבצות המכילות את השיעור שכבר קיים במערכת השעות מתכווץ בארכו ויש לנו את
                        האפשרות לשבץ את השיעור החדש במקביל לשיעור שכבר משובץ.
                    </p>
                    <br />
                    <p>דוגמא:</p>
                    נרצה לשבץ את שיעור צרפתית במקביל לשיעור מיתולוגיה שכבר משובץ במערכת השעות הנלמד בשכבה ז1
                    <div className="w-100 text-center">
                        <img src={split} className="border" alt="gif" width="75%"></img>
                    </div>
                </ul>
                <br />
                <ul>
                    <h5>הגדרת שיעור לשיבוץ שהוגדר לו חדר לימוד ייעודיי.</h5>
                    <p>
                        ברגע שנרצה לשבץ שיעור שהוגדר לו מאפיין ייחודיי שהמקצוע הנלמד בו דורש, ברגע שנלחץ על שיעור זה מלבן "חדרי הלימוד" יציג אך ורק את חדרי
                        לימוד אפשר מספקים מאפיין זה.
                    </p>
                    <br />
                    <p>דוגמא:</p>
                    נרצה לשבץ את שיעור הטמעת יישומי מחשב בכיתה ז1, מקצוע זה דורש חדר לימוד שיש בו מחשבים. ברגע שנלחץ על השיעור נראה שמלבן "חדרי לימוד" מציג לנו
                    רק את חדר הלימוד "חדר מחשבים" מפני שזה החדר היחיד המכילים בתוכו מחשבים.
                    <div className="w-100 text-center">
                        <img src={specificRoom} className="border" alt="gif" width="75%"></img>
                    </div>
                </ul>
                <br />
                <ul>
                    <h5>איפוס טבלת מערכת שעות של כיתה אחת.</h5>
                    <p>
                        אם נרצה להסיר את כל השיעורים ששובצו במערכת השעות של הכיתה שאותה כרגע אנחנו רואים פשוט נלחץ על כפתור "אפס טבלה נוכחית" וכל השיעורים
                        ששובצו בטבלת מערכת השעות יחזרו למלבן "שיעורים עבור כיתה זו".
                    </p>
                    <br />
                    דוגמא לאיפוס טבלת מערכת השעות של כיתה ז2 בלבד
                    <div className="w-100 text-center">
                        <img src={resetTable} className="border" alt="gif" width="75%"></img>
                    </div>
                </ul>
                <br />
                <ul>
                    <h5>איפוס כל טבלאות מערכי השעות של כל כיתות הבית ספר.</h5>
                    <p>
                        אם נרצה להסיר את כל השיעורים ששובצו בכל מערכי השעות של כיתות בית הספר פשוט נלחץ על כפתור "אפס כל הטבלאות" וכל השיעורים ששובצו בטבלת
                        מערכת השעות יחזרו למלבן "שיעורים עבור כיתה זו" עבור כל כיתות בית הספר.
                    </p>
                    <br />
                    דוגמא לאיפוס כל טבלאות מערכי השעות של הבית ספר 
                    <div className="w-100 text-center">
                        <img src={resetAllTables} className="border" alt="gif" width="75%"></img>
                    </div>
                </ul>
            </div>
        );
    }
}

export default Guide;
