import React, { Component } from 'react';

class Guide extends Component {
    render() {
        return (
            <div style={{ "textAlign": "right" }}>
                <h3 className='mt-2'>ברוכים הבאים למערכת בניית מערכת שעות</h3>
                <h5>במהלך המדריך הבא נסביר מה השלבים הנכונים לבניית מערכת השעות תוך כדי הצגת דוגמאות להבנה טובה יותר.</h5>
                <p>לפני שנבצע את תהליך בניית המערכת צריך קודם להגדיר את כל נתוני בית הספר בצורה נכונה ובסדר נכון, לאחר שהגדרנו את כל נתוני בית הספר נתחיל עם תהליך הבנייה של המערכת.</p>
                <p>הערה חשובה לפני שמתחילים, סדר השלבים המתוארים בחלק זה הינם הצורה הנכונה להגדיר את נתוני המערכת ולכן מומלץ להגדיר את הנותנים בסדר השלבים המתואר.</p>
                <h5>שלבי הגדרת נתוני בית הספר בסדר ובצורה הנכונה:</h5>
                <ul>
                    <li>
                        נלחץ על לשונית "הגדרת נתונים ושיעורים".<br />
                        <p>כעת יפתח לך סרגל כלי משני שמציג את כל הנתונים שניתן להגדיר (שלד המערכת, שכבות וכיתות, חדרי לימוד, מקצועות מורים והגדרת שיעורים).</p>
                        <h6>שלב ראשון – הגדרת שלד המערכת:</h6>
                        <p>במסך זה נצטרך להגדיר את שלד מערכת השעות של בית הספר באופן כללי. נבחר יום בשבוע ונגדיר לו שעת התחלה ושעת סיום.</p>
                        <p>בכל שלב במהלך הגדרת שלד המערכת ניתן לערוך המערכת או למחוק יום שהגדרנו.</p>
                        <ul>הערות לשלב זה:
                            <li>אם כבר בנינו והגדרנו מערכת שעות (אפילו רק לכיתה אחת), שינויים בשלד המערכת לא ישפיעו על המערכת שהגדרנו, לכן חשוב להגדיר את שלד המערכת בתור התחלה בצורה המדויקת ביותר.</li>
                            <li>אם כן נצטרך לבצע שינוי בשלד המערכת לאחר שכבר התחלנו להגדיר את מערכת השעות, נצטרך תחילה למחוק את מערכת השעות שהגדרנו ואז שינויים על שלד המערכת ישפיעו על תצוגת מערכת השעות.</li>
                        </ul>
                        <h6>שלב שני – הגדרת שכבות וכיתות:</h6>
                        <p>במסך זה נצטרך להגדיר את שכבות וכיתות בית הספר בית הספר. נבחר שכבה ונגדיר לה את מספר הכיתות שהיא מכילה.</p>
                        <p>בכל שלב במהלך הגדרת שכבות וכיתות ניתן לערוך המערכת או למחוק שכבה שהגדרנו.</p>
                        <ul>הערות לשלב זה:
                            <li>אם כבר בנינו והגדרנו מערכת שעות (אפילו רק לכיתה אחת), שינויים בשכבות וכיתות לא ישפיעו על המערכת שהגדרנו, לכן חשוב להגדיר את שכבות וכיתות בית הספר בתור התחלה בצורה המדויקת ביותר.</li>
                            <li>אם כן נצטרך לבצע שינוי בשכבות הכיתה לאחר שכבר התחלנו להגדיר את מערכת השעות, נצטרך תחילה למחוק את מערכת השעות שהגדרנו ואז שינויים שכבות וכיתות בית הספר ישפיעו על תצוגת מערכת השעות.</li>
                        </ul>
                        <h6>שלב שלישי – הגדרת חדרי לימוד:</h6>
                    </li>
                </ul>
            </div>
        );
    }
}

export default Guide;
